# Fall 2021 Data Science Intern Challenge

In [1]:
import pandas as pd

## Question 1

On Shopify, we have exactly 100 sneaker shops, and each of these shops sells only one model of shoe. We want to do some analysis of the average order value (AOV). When we look at orders data over a 30 day window, we naively calculate an AOV of $\$3145.13$. Given that we know these shops are selling sneakers, a relatively affordable item, something seems wrong with our analysis. 

Think about what could be going wrong with our calculation. Think about a better way to evaluate this data. \
What metric would you report for this dataset? \
What is its value?

In [2]:
df = pd.read_csv('data/2019 Winter Data Science Intern Challenge Data Set - Sheet1.csv')

In [3]:
# AOV of $3145.13
df.order_amount.mean()

3145.128

In [4]:
df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11

In [5]:
df.shape

(5000, 7)

In [6]:
df.columns

Index(['order_id', 'shop_id', 'user_id', 'order_amount', 'total_items',
       'payment_method', 'created_at'],
      dtype='object')

In [7]:
# drop duplicates
dfn = df.drop_duplicates(subset=['shop_id', 'user_id', 'order_amount', 'total_items', 'payment_method', 'created_at'])

In [8]:
dfn.shape

(4995, 7)

In [9]:
dfn['price'] = dfn.order_amount/dfn.total_items

dfn.drop_duplicates(['price']).sort_values('price', ascending=False).head()

<ipython-input-9-d1967d1cd49a>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfn['price'] = dfn.order_amount/dfn.total_items

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at,price
160,161,78,990,25725,1,credit_card,2017-03-12 5:56:57,25725.0
15,16,42,607,704000,2000,credit_card,2017-03-07 4:00:00,352.0
107,108,12,732,201,1,credit_card,2017-03-21 20:26:18,201.0
205,206,89,747,588,3,debit,2017-03-04 4:01:38,196.0
44,45,99,759,195,1,credit_card,2017-03-02 8:13:24,195.0

In [10]:
# ignore ship_id 78 with price $25725
df78 = dfn[dfn.shop_id!=78]
df78.order_amount.sum()/df78.total_items.sum()

293.72016071850624